tests/load/load-test.yml
# Phase 10 - Artillery Load Test Configuration
# Tests webhook queue performance under load (100 req/s for 10 seconds)

cconfig:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 50  # Reduced from 100 to be more realistic
      name: "Sustained load"
  defaults:
    headers:
      X-Webhook-Token: "{{ $processEnvironment.DASH_WEBHOOK_TOKEN }}"
      Content-Type: "application/json"
  processor: "./load-test-processor.js"  # Add payload generator

scenarios:
  - name: "Email Event Webhook"
    flow:
      - post:
          url: "/api/events"
          json:
            idempotency_key: "load-test-{{ $randomNumber(1, 1000000) }}"
            contact_email: "test{{ $randomNumber(1, 10000) }}@example.com"
            event_type: "{{ $randomItem(['sent', 'delivered', 'opened', 'clicked', 'replied']) }}"
            campaign: "Load Test Campaign"
            step: "{{ $randomNumber(1, 3) }}"
            provider: "instantly"
            event_ts: "{{ $timestamp() }}"